app/controllers/users_controller.rb

  def index
    @title = 'All users'
    @users = User.paginate(:page => params[:page])
---
SELECT COUNT(*) FROM `users`
SELECT `users`.* FROM `users` LIMIT 30 OFFSET 0

  def show
    @user = User.find params[:id]
---
SELECT `users`.* FROM `users` WHERE `users`.`id` = 1 LIMIT 1

  def create
    @user = User.new params[:user]
    if @user.save
---
INSERT INTO `users` (`name`, `email`, `created_at`, `updated_at`, `encrypted_password`, `salt`) VALUES ('Rails Tutorial', 'examples@railstutorial.org', '2011-02-14 20:06:49', '2011-02-14 20:06:49', '57b7591ed4e606bebe2c5eb9354d08f34f593433793fc49e890806843dd41ed5', '6ed74a97063c3d74c5a8a1b3841acac346f15d2c0611e42c9f29c2053d31e3d0')